Simulation/cfd/template/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// Wind-tunnel domain around the rocket
// Rocket sits at origin, aligned along X-axis
// Domain extends ~10 body diameters in each direction

scale   1;

// Placeholders replaced by run_case.py
xMin    __XMIN__;
xMax    __XMAX__;
yMin    __YMIN__;
yMax    __YMAX__;
zMin    __ZMIN__;
zMax    __ZMAX__;

nX      __NX__;
nY      __NY__;
nZ      __NZ__;

vertices
(
    ($xMin $yMin $zMin)
    ($xMax $yMin $zMin)
    ($xMax $yMax $zMin)
    ($xMin $yMax $zMin)
    ($xMin $yMin $zMax)
    ($xMax $yMin $zMax)
    ($xMax $yMax $zMax)
    ($xMin $yMax $zMax)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($nX $nY $nZ) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    walls
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (2 3 7 6)
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);
