Simulation/cfd/template/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (__UX__ __UY__ __UZ__);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (__UX__ __UY__ __UZ__);
    }

    outlet
    {
        type            zeroGradient;
    }

    walls
    {
        type            slip;
    }

    rocket
    {
        type            noSlip;
    }
}
