Simulation/cfd/template/0/k
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform __K__;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform __K__;
    }

    outlet
    {
        type            zeroGradient;
    }

    walls
    {
        type            slip;
    }

    rocket
    {
        type            kqRWallFunction;
        value           uniform __K__;
    }
}
