Simulation/cfd/template/0/omega
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform __OMEGA__;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform __OMEGA__;
    }

    outlet
    {
        type            zeroGradient;
    }

    walls
    {
        type            slip;
    }

    rocket
    {
        type            omegaWallFunction;
        value           uniform __OMEGA__;
    }
}
